---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReinforcementSettings.IsEqual(Autodesk.Revit.DB.Structure.ReinforcementSettings)
source: html/f6924dbf-c3de-6b0a-ba9f-166a9c8a8819.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementSettings.IsEqual Method

Checks if Reinforcement Settings is equal to other

## Syntax (C#)
```csharp
public bool IsEqual(
	ReinforcementSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Structure.ReinforcementSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null